GENERIC_ERROR_MESSAGE=Ocorreu um erro inesperado no sistema. Tente novamente e, se o problema persistir, entre em contato com o administrador do sistema.
ARGUMENT_NOT_VALID_ERROR=Um ou mais campos est\u00E3o inv\u00E1lidos. Fa\u00E7a o preenchimento correto e tente novamente.
ERROR_ON_DESERIALIZATION=O corpo da requisi\u00E7\u00E3o est\u00E1 inv\u00E1lido. Verifique se h\u00E1 erro de sintaxe.
INVALID_FORMAT_ERROR=A propriedade recebeu o valor '%s', que est\u00E1 em um formato inv\u00E1lido. Corrija e informe um valor compat\u00EDvel.
GENERIC_RESOURCE_NOT_FOUND=O recurso solicitado n\u00E3o foi encontrado.
PROPERTY_BINDING_ERROR=A propriedade '%s' n\u00E3o existe no objeto '%s'.
INVALID_OPERATION_EXCEPTION=N\u00E3o foi poss\u00EDvel processar sua solicita\u00E7\u00E3o. Verifique os dados informados e tente novamente.

#Profile
PROFILE_NOT_FOUND_EXCEPTION=Nenhum perfil encontrado para o tipo: %s
PROFILE_ALREADY_EXIST_EXCEPTION=J\u00E1 existe um perfil criado com o nome: %s
PROFILE_DATA_NOT_VALID=Os dados enviados s\u00E3o inv\u00E1lidos para o cadastro do perfil.
PROFILE_IS_OWNER_OR_CLIENT=N\u00E3o \u00e9 permitida a exclus\u00E3o dos perfis padr\u00E3o OWNER e CLIENT.

#User
USER_NOT_FOUND_EXCEPTION=Nenhum usu\u00E1rio encontrado para o id: %s
REGISTER_FAILED_EXCEPTION=N\u00E3o foi poss\u00EDvel concluir o cadastro com os dados informados.
USER_MUST_HAVE_AT_LEAST_ONE_ADDRESS=O usu\u00E1rio precisa ter pelo menos um endere\u00E7o principal cadastrado.
USER_HAS_ACTIVE_RESTAURANT=O usu\u00E1rio possui restaurante(s) ativo(s) associado(s) a ele.
USER_IS_ALREADY_INACTIVE=O usu\u00E1rio j\u00E1 se encontra desativado.
USER_IS_ALREADY_ACTIVE=O usu\u00E1rio j\u00E1 se encontra ativado.

#Address
INVALID_POSTAL_CODE_MSG=O CEP precisa ter %d d\u00EDgitos.
FIRST_ADDRESS_MUST_BE_MAIN=O primeiro endere\u00E7o deve ser passado como principal.
ADDRESS_NOT_FOUND_EXCEPTION=Nenhum endere\u00E7o encontrado para o id: %d

#Auth
LOGIN_FAILED_EXCEPTION=Erro ao logar, login ou senha incorretos
TOKEN_EXPIRED_EXCEPTION=Token expirado
INVALID_PASSWORD_MSG=A senha deve conter no m\u00EDnimo %d caracteres, incluindo letra mai\u00FAscula, min\u00FAscula, n\u00FAmero e s\u00EDmbolo.

#Restaurant
RESTAURANT_INVALID_WORKING_TIME=O hor\u00E1rio de abertura e funcionamneto n\u00E3o podem ser iguais e devem ser declarados para restaurantes que n\u00E3o funcionem 24h.
WORKING_TIME_TOO_SHORT=O restaurante precisa ter no m\u00EDnimo uma hora de funcionamento.
RESTAURANT_ALREADY_EXIST=Estabelecimento j\u00E1 cadastrado em nosso sistema.
AROUND_THE_CLOCK_RESTAURANTS_SHOULDNT_DECLARE_WORKING_HOURS=Restaurantes que funcionam 24h n\u00E3o devem declarar hor\u00E1rio de abertura e fechamento.
ZONE_ID_DO_NOT_EXIST=O zone id enviado n\u00E3o existe.
RESTAURANT_NOT_FOUND_EXCEPTION=Nenhum restaurante encontrado para o id: %s
RESTAURANT_USER_DOES_NOT_HAVE_OWNERSHIP_OR_IS_INACTIVE=A\u00E7\u00E3o n\u00E3o permitida para este usu\u00E1rio.
RESTAURANT_IS_ALREADY_INACTIVE=O restaurante j\u00E1 se encontra desativado.
RESTAURANT_IS_ALREADY_ACTIVE=O restaurante j\u00E1 se encontra ativado.
RESTAURANT_DOES_NOT_EXIST=O restaurante buscado n\u00E3o existe.
RESTAURANT_IS_INACTIVE_CANNOT_UPDATE=N\u00E3o foi poss\u00EDvel realizar a opera\u00E7\u00E3o solicitada.

#Food Item
RESTAURANT_IS_INACTIVE=O restaurante informado est\u00E1 inativo e n\u00E3o permite esta opera\u00E7\u00E3o.
FOOD_ITEM_ALREADY_EXIST=O produto a ser adicionado no card\u00E1pio j\u00E1 existe para o restaurante informado.
FOOD_ITEM_NOT_FOUND=Food item n\u00E3o encontrado para o restaurante informado.
FOOD_ITEM_IS_ALREADY_INACTIVE=O food item j\u00E1 se encontra desativado.
FOOD_ITEM_IS_ALREADY_ACTIVE=O food item j\u00E1 se encontra ativado.
FOOD_ITEM_INACTIVE_CANNOT_UPDATE_AVAILABILITY=N\u00E3o \u00E9 poss\u00EDvel alterar a disponibilidade de um food item inativo.
FOOD_ITEM_UNAVAILABLE_CANNOT_ENABLE_DELIVERY=N\u00E3o \u00E9 poss\u00EDvel habilitar delivery para um food item indispon\u00EDvel.
FOOD_ITEM_NOT_FOUND_EXCEPTION=Nenhum item do card\u00E1pio  encontrado para o id: %s
FOOD_ITEM_DOES_NOT_EXIST=O produto de id: %s n\u00E3o existe no banco de dados.
FOOD_ITEM_DOES_NOT_EXIST_IN_RESTAURANT= O produto de id:%s n\u00E3o existe no restaurante cadastrado

#Order
ORDER_NOT_FOUND_EXCEPTION=Nenhum pedido encontrado para o id: %s
FOOD_ITEM_UNAVAILABLE_FOR_ORDER=O item de id: %s não está disponível para pedido.
